; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c2-s1-p7-a7)

(:domain logistics)

(:objects a0 a1 a2 a3 a4 a5 a6 - airplane
          c0 c1 - city
          t0 t1 - truck
          l0-0 l1-0 - airport
          p0 p1 p2 p3 p4 p5 p6 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l1-0 c1)
    (at t0 l0-0)
    (at t1 l1-0)
    (at p0 l1-0)
    (at p1 l0-0)
    (at p2 l0-0)
    (at p3 l0-0)
    (at p4 l1-0)
    (at p5 l0-0)
    (at p6 l0-0)
    (at a0 l1-0)
    (at a1 l0-0)
    (at a2 l1-0)
    (at a3 l1-0)
    (at a4 l1-0)
    (at a5 l1-0)
    (at a6 l1-0)
)

(:goal
    (and
        (at p0 l0-0)
        (at p1 l0-0)
        (at p2 l1-0)
        (at p3 l0-0)
        (at p4 l1-0)
        (at p5 l1-0)
        (at p6 l1-0)
    )
)
)

; plan
1. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 3 of 7
2. (fly a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 3 of 7
3. (fly a5 l1-0 l0-0)
   deleted: (at a5 l1-0)
   added: (at a5 l0-0)
   goals met: 3 of 7
4. (fly a6 l1-0 l0-0)
   deleted: (at a6 l1-0)
   added: (at a6 l0-0)
   goals met: 3 of 7
5. (load t0 p1 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 2 of 7
6. (load t0 p2 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 t0)
   goals met: 2 of 7
7. (load t0 p3 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 1 of 7
8. (load t0 p5 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 t0)
   goals met: 1 of 7
9. (load t0 p6 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 t0)
   goals met: 1 of 7
10. (load t1 p0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t1)
   goals met: 1 of 7
11. (load t1 p4 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 t1)
   goals met: 0 of 7
12. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 0 of 7
13. (fly a4 l1-0 l0-0)
   deleted: (at a4 l1-0)
   added: (at a4 l0-0)
   goals met: 0 of 7
14. (fly a5 l0-0 l1-0)
   deleted: (at a5 l0-0)
   added: (at a5 l1-0)
   goals met: 0 of 7
15. (fly a6 l0-0 l1-0)
   deleted: (at a6 l0-0)
   added: (at a6 l1-0)
   goals met: 0 of 7
16. (unload t0 p2 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 0 of 7
17. (unload t0 p5 l0-0)
   deleted: (in p5 t0)
   added: (at p5 l0-0)
   goals met: 0 of 7
18. (unload t0 p6 l0-0)
   deleted: (in p6 t0)
   added: (at p6 l0-0)
   goals met: 0 of 7
19. (unload t1 p0 l1-0)
   deleted: (in p0 t1)
   added: (at p0 l1-0)
   goals met: 0 of 7
20. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 0 of 7
21. (fly a3 l1-0 l0-0)
   deleted: (at a3 l1-0)
   added: (at a3 l0-0)
   goals met: 0 of 7
22. (load a1 p0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a1)
   goals met: 0 of 7
23. (load a2 p2 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a2)
   goals met: 0 of 7
24. (load a2 p5 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 a2)
   goals met: 0 of 7
25. (load a2 p6 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a2)
   goals met: 0 of 7
26. (fly a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 0 of 7
27. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 0 of 7
28. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 7
29. (fly a3 l0-0 l1-0)
   deleted: (at a3 l0-0)
   added: (at a3 l1-0)
   goals met: 0 of 7
30. (fly a4 l0-0 l1-0)
   deleted: (at a4 l0-0)
   added: (at a4 l1-0)
   goals met: 0 of 7
31. (fly a5 l1-0 l0-0)
   deleted: (at a5 l1-0)
   added: (at a5 l0-0)
   goals met: 0 of 7
32. (fly a6 l1-0 l0-0)
   deleted: (at a6 l1-0)
   added: (at a6 l0-0)
   goals met: 0 of 7
33. (unload a1 p0 l0-0)
   deleted: (in p0 a1)
   added: (at p0 l0-0)
   goals met: 1 of 7
34. (unload a2 p2 l1-0)
   deleted: (in p2 a2)
   added: (at p2 l1-0)
   goals met: 2 of 7
35. (unload a2 p5 l1-0)
   deleted: (in p5 a2)
   added: (at p5 l1-0)
   goals met: 3 of 7
36. (unload a2 p6 l1-0)
   deleted: (in p6 a2)
   added: (at p6 l1-0)
   goals met: 4 of 7
37. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 4 of 7
38. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 4 of 7
39. (fly a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 4 of 7
40. (fly a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 4 of 7
41. (fly a5 l0-0 l1-0)
   deleted: (at a5 l0-0)
   added: (at a5 l1-0)
   goals met: 4 of 7
42. (fly a6 l0-0 l1-0)
   deleted: (at a6 l0-0)
   added: (at a6 l1-0)
   goals met: 4 of 7
43. (unload t0 p1 l0-0)
   deleted: (in p1 t0)
   added: (at p1 l0-0)
   goals met: 5 of 7
44. (unload t0 p3 l0-0)
   deleted: (in p3 t0)
   added: (at p3 l0-0)
   goals met: 6 of 7
45. (unload t1 p4 l1-0)
   deleted: (in p4 t1)
   added: (at p4 l1-0)
   goals met: 7 of 7
